{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.6.0", "signature": {"inputs": {"input_1:0": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/regressor/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/regressor/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/regressor/dense_8/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/regressor/dense_8/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/regressor/dense_9/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/regressor/dense_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/regressor/dense_7/Relu", "op": "_FusedMatMul", "input": ["input_1", "StatefulPartitionedCall/regressor/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/regressor/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/regressor/dense_8/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/regressor/dense_7/Relu", "StatefulPartitionedCall/regressor/dense_8/MatMul/ReadVariableOp", "StatefulPartitionedCall/regressor/dense_8/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/regressor/dense_9/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/regressor/dense_8/Relu", "StatefulPartitionedCall/regressor/dense_9/MatMul/ReadVariableOp", "StatefulPartitionedCall/regressor/dense_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/regressor/dense_9/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/regressor/dense_7/MatMul/ReadVariableOp", "shape": [10, 100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/regressor/dense_7/BiasAdd/ReadVariableOp", "shape": [100], "dtype": "float32"}, {"name": "StatefulPartitionedCall/regressor/dense_8/MatMul/ReadVariableOp", "shape": [100, 20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/regressor/dense_8/BiasAdd/ReadVariableOp", "shape": [20], "dtype": "float32"}, {"name": "StatefulPartitionedCall/regressor/dense_9/MatMul/ReadVariableOp", "shape": [20, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/regressor/dense_9/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}